# -*- coding: utf-8 -*-

TYPE_ID_NAME = {'0': '', '1': '会员', '2': '合作伙伴'}  # 用户类型对应关系

ROLE_ID_NAME = {'0': '', '1': '银勋', '2': '金勋', '3': '王牌', '4': '荣誉'}  # 角色名称对应关系

COURSE_PRICE = {'1': '2999', '2': '6999', '3': '8800', '4': '19800'}  # 角色对于课程价格

SALE_COURSE_PRICE = {'1': '2999', '2': '6999', '3': '8800', '4': '15800'}  # 角色对应优惠的课程价格

PAYMENTS_TYPE = {'1': '返利', '2': '推广佣金', '3': '感恩奖', '4': '领导奖', '5': '提现', '6': '消费',
                 '7': '返利提现', '8': '推广提现', '9':'冻结'}  # 收支明细类型

SPREAD_BROKERAGE_SON = {'1': '0.05', '2': '0.08', '3': '0.1', '4': '0.15'}  # 一代推广佣金

# SPREAD_BROKERAGE_GRANDSON = {'1': '0.02', '2': '0.03', '3': '0.04', '4': '0.05'}  # 二代推广佣金

EVERYDAY_MAX_REBATE_AMOUNT = {'1': '50', '2': '50', '3': '100', '4': '200'}  # 2-金勋，3-王牌，4-荣誉 对应的每天最大返利额度

# TOTAL_MAX_REBATE_AMOUNT = {'2': float(COURSE_PRICE['2']) * 1.5, '3': float(COURSE_PRICE['3']) * 2,
#                            '4': (float(COURSE_PRICE['4']) - 4000) * 2}  # 2-金勋，3-王牌，4-荣誉  对应总共的最大返利额度
AWARD_PROPORTION = {'thanksGiving': 0.03, 'leading': 0.1}  # thanksGiving-感恩奖，leading-领导奖   对应的奖励比率

FROZEN_LIVENESS = 52  # 活跃度冻结分数

